Repository: mem3Dealer/disCuss
Catalog: lib/core/localization/l10n/intl_*.arb
Languages: de, ru

# areYouNew
source: New to DisCuss? Register
de: Sind Sie neu bei Discuss? Registrieren
ru: Вы новичок в DisCuss? Зарегестрируйтесь

source: Password
de: Passwort
ru: Пароль

# passwordIsIncorrect
source: Please, enter password
de: Bitte Passwort eingeben
ru: Пожалуйста, введите пароль

# passwordIsTooShort
source: Enter password 6+ long
de: Geben Sie ein Passwort mit mindestens sechs Zeichen ein
ru: Пароль должен быть длиннее 6 символов

source: Sign In
de: Einloggen
ru: Войти

source: E-mail
ru: Эл. почта

# emailIsEmpty
source: Please, enter Your e-mail
de: Bitte geben Sie ihre E-Mail-Adresse ein
ru: Пожалуйста, введите вашу эл. почту

# regNameLabel
source: What is your name?
de: Wie heißt du?
ru: Как вас зовут?

# regNameHelper
source: It should be at least 2 characters long
de: Es sollte mindestens 2 Zeichen lang sein
ru: Имя должно быть длиной минимум два знака

# regNameMissing
source: Please, enter Your name
de: Bitte geben Sie Ihren Namen ein
ru: Пожалуйста, укажите ваше имя

# regNameTooShort
source: Name is too short
de: Name ist zu kurz
ru: Имя слишком короткое

# regNickNameLabel
source: Enter your nickname
de: Geben Sie Ihren Spitznamen ein
ru: Введите ваш никнейм

# regNickNameHelper
source: It should start with @
de: Es sollte mit @ beginnen
ru: Он должен начинаться с @

# regNickNameNoAt
source: please enter nickname starting with @
de: Bitte geben Sie den Nicknamen ein, der mit @ beginnt
ru: Пожалуйста, введите ваш никнейм, начиная с @

# regNickNameTooShort
source: Nickname should be at least 4 characters long
de: Spitzname sollte mindestens 4 Zeichen lang sein
ru: Никнейм должен состоять из четырех символов как минимум

# regEmail
source: Enter your e-mail
de: Geben Sie Ihre E-Mail-Adresse ein
ru: Введите вашу эл. почту

# regEmailIsEmpty
source: Enter an email adress
de: Geben Sie eine E-Mail-Adresse ein
ru: Укажите вашу эл. почту

# regEmailNoAt
source: Please enter valid email
de: Bitte gültige E-Mail eingeben
ru: Пожалуйста укажите существующий адрес эл. почты

# regPassword
source: Create password
de: Passwort erstellen
ru: Придумайте пароль

# regPasswordHelper
source: It should be at least 6 chatacters long
de: Es sollte mindestens 6 Chatacter lang sein
ru: Он должен быть длиной как минимум 6 символов

# regPasswordIsTooShort
source: Enter an password 6+ long
de: Geben Sie ein Passwort von 6+ Länge ein
ru: Пароль слишком короткий

# regYouAreNotNew
source: Already have an account? Sign in
de: Sie haben bereits ein Konto? Anmelden
ru: Уже есть аккаунт? Войдите

# regRegister
source: Register
de: Registrieren
ru: Зарегистрироваться

# grCreditingPageTitle
source: Editing Page
de: Bearbeitungsseite
ru: Страница редактирования

# grCrNewDiscussionTitle
source: Create new discussion
de: Neue Diskussion erstellen
ru: Создать новое обсуждение

# grCrNewDiscussionInThisCat
source: New {category} discussion
de: Neue {category} Diskussion
ru: Новое обсуждение в категории {category}

# grCrMessageOfDifinedCat
source: You are creating new discussion in {category} category.
de: Sie erstellen eine neue Diskussion in der Kategorie {category}.
ru: Вы создаете новон обсуждение в категории{category}

# grCrSelectCat
source: Please, select category for future discussion below:
de: Bitte wählen Sie unten eine Kategorie für die zukünftige Diskussion aus:
ru: Пожалуйста, выберите категорию будущего обсуждения ниже:

# grCrAddNewMembers
source: Add new members
de: Neue Mitglieder hinzufügen
ru: Добавить новых участников

# grCrFutureParticipants
source: You may add future participants below:
de: Sie können unten zukünftige Teilnehmer hinzufügen:
ru: Вы можете добавить будущих участников ниже:

# grCrUserAlreadySelected
source: This user is already selected
de: Dieser Benutzer ist bereits ausgewählt
ru: Этот пользователь уже выбран

# grCrNickNameNoAt
source: Please enter nickname starting with @
de: Bitte geben Sie den Nicknamen ein, der mit @ beginnt
ru: Пожалуйста, введите никнейм, начиная с @

# grCrNoCategorySelected
source: Please select category
de: Bitte Kategorie auswählen
ru: Пожалуйста, выберите категорию

# grCrSelectCatHintText
source: Select category
de: Kategorie auswählen
ru: Выберите категорию

# grCrSaveChanges
source: Save changes
de: Änderungen speichern
ru: Сохранить изменения

# grCrDiscussButton
source: Discuss
de: Diskussion
ru: Обсудить

# grCrContEditLabel
source: Edit content
de: Inhalt bearbeiten
ru: Редактировать контент

# grCrContNoContent
source: Please enter dicsussion content
de: Bitte Diskussionsinhalt eingeben
ru: Пожалуйста, укажите контент будущего обсуждения

# grCrContContentIsTooShort
source: Please, expand your topic
de: Bitte erweitern Sie Ihr Thema
ru: Пожалуйста, раскройте тему

# grCrContLabelOfNewDiscussion
source: Content of discussion
de: Inhalt der Diskussion
ru: Контент обсуждения

# grCrContNewDiscussionHelper
source: Should be at least couple of words
de: Sollte mindestens ein paar Worte enthalten
ru: Должно быть пару слов как минимум

# grCrTopicIsEmpty
source: Please enter discussion topic!
de: Bitte Diskussionsthema eingeben!
ru: Пожалуйста, введите тему обсуждения!

# grCrTopicIsTooShort
source: Please be more specific
de: Bitte seien Sie genauer
ru: Тема слишком короткая

# grCrTopicEditLabel
source: Edit theme
de: Thema bearbeiten
ru: Редактировать тему

# grCrTopicNewLabel
source: Topic of discussion
de: Diskussionsthema
ru: Тема обсуждения

# grCrTopicHelperText
source: Enter main idea of this discussion. Press lock icon to make discussion private
de: Geben Sie die Hauptidee dieser Diskussion ein. Drücken Sie das Schlosssymbol, um die Diskussion privat zu machen
ru: Введите главную идею обсуждения. Нажмите иконку замка, чтобы сделать обсуждение приватным

# homePageTitle
source: {category} rooms
de: {category}-Zimmer
ru: Комнаты категории {category}

# homeNoRooms
source: There are no rooms in this category. Be very first and start new discussion!
de: Es gibt keine Räume in dieser Kategorie. Sei der Erste und starte eine neue Diskussion!
ru: В этой категории нет комнат. Будь самым первым, и начни обсуждение!

# memPageTitle
source: Chat Members
de: Chat-Mitglieder
ru: Участники чата

# memPageLabelCreator
source: Creator
de: Ersteller
ru: Создатель

# memPageLabelAdmins
source: Admins
ru: Модераторы

# memPageLabelMembers
source: Members
de: Mitglieder
ru: Участники

# memPageLabelReqs
source: Join Requests
de: Anfragen beitreten
ru: Запросы на вступление

# memPageLabelBanned
source: Banned users:
de: Gesperrte Benutzer:
ru: Забаненные пользователи:

# memPageButtonSave
source: Save
de: Speichern
ru: Сохранить

# memPageButtonCancel
source: Cancel
de: Abbrechen
ru: Отмена

# memTilesDeleteWarning
source: Delete this room?
de: Diesen Raum löschen?
ru: Удалить комнату?

# memTilesDelete
source: Delete
de: Löschen
ru: Удалить

# memTilesLeaveWarning
source: Leave this room?
de: Diesen Raum verlassen?
ru: Покинуть эту комнату?

# memTilesLeave
source: Leave
de: Verlassen
ru: Выйти

# memTilesActionKick
source: Kick
de: Trete
ru: Выгнать

# memTilesActionBan
source: Ban
de: Verbot
ru: Забанить

# memTilesActionDemote
source: Demote
de: Degradieren
ru: Понизить

# memTilesActionPromote
source: Promote
de: Fördern
ru: Повысить

# memTilesActionCantWrite
source: Can`t write
de: Kann nicht schreiben
ru: Заглушить пользователя

# memTilesActionAccept
source: Accept
de: Akzeptieren
ru: Принять

# memTilesActionDecline
source: Decline
de: Ablehnen
ru: Отклонить

# memTilesActionUnban
source: Unban
de: Aufheben
ru: Разбанить

# chatPageSnackForPerm
source: Well, {name}, you can`t write here. Go ask for perm.
de: Nun, {name}, du kannst hier nicht schreiben. Frag nach einer Dauerwelle.
ru: Что ж, {name}, кажется вы не можете здесь писать. Отправьте запрос.

# chatPageSnackForOpenRoom
source: Hit + to join this room and be able to send messages
de: Drücken Sie +, um diesem Raum beizutreten und Nachrichten senden zu können
ru: Нажите + чтобы вступить в обсуждение и отправлять сообщения

# chatPageSnackSentRequest
source: Join reqeust sent. Fingers crossed
de: Beitrittsanfrage gesendet. Daumen drücken
ru: Запрос на вступление отправлен

# chatPageSnackJoinedRoom
source: You have joined this room. Be nice!
de: Du bist diesem Raum beigetreten. Sei nett!
ru: Вы вступили в это обсуждение

# chatPageBodyMessageBanned
source: You were banned from this discussion
de: Sie wurden von dieser Diskussion ausgeschlossen
ru: Вы были забанены в этом обсуждении

# chatPageBodyMessageNotMember
source: You are not yet member of this group
de: Sie sind noch kein Mitglied dieser Gruppe
ru: Вы ещё не участник этого обсуждения

# chatPageBodyMessageRequestDev
source: Your request is under develeopement
de: Ihre Anfrage befindet sich in Entwicklung
ru: Ваш запрос рассматривается

# chatPageBodyMessageEmptyChat
source: ooops... Such empty!
de: oops... So leer!
ru: уууупс... Так пусто!

# dbCatsSport
source: Sport
ru: Спорт

# dbCatsVideoGames
source: Video Games
de: Videospiele
ru: Видеоигры

# dbCatsLiterature
source: Literature
de: Literatur
ru: Литература

# dbCatsRock
source: Rock`n`Roll
ru: Рок-н-ролл

# dbCatsPhysics
source: Physics
de: Physik
ru: Физика

# dbCatsRenissans
source: Renissans
ru: Ренессанс

# dbCatsStarWars
source: Star Wars
ru: Звёздные войны

# dbCatsHike
source: Hike
de: Wanderung
ru: Пеший туризм

# dbCatsPolitics
source: Politics
de: Politik
ru: Политика

# dbCatsGlobalWarming
source: Global Warming
de: Globale Erwärmung
ru: Глобальное потепление

# dbCatsBelgiumCrysis
source: Belgium Crysis
ru: Бельгийский кризис

# dbCatsClothes
source: Clothes
de: Kleidung
ru: Шмотки

# dbCatsPsychologies
source: Psychologies
de: Psychologien
ru: Психология

# dbCatsAstrology
source: Astrology
de: Astrologie
ru: Астрология

# dbCatsCats
source: Cats
de: Katzen
ru: Кошки

# catsPage
source: Select category
de: Kategorie auswählen
ru: Выберите категорию

# authStatusInvEmail
source: Your email address appears to be malformed.
de: Ihre E-Mail-Adresse scheint fehlerhaft zu sein.
ru: Ваш адрес эл. почты указан неверно.

# authStatusWrongPassword
source: Your password is wrong.
de: Ihr Passwort ist falsch.
ru: Неправильный пароль

# authStatusUserNotFound
source: User with this email doesn't exist.
de: Benutzer mit dieser E-Mail existiert nicht.
ru: Пользователя с этой эл. почтой не существует.

# authStatusUserDisabled
source: User with this email has been disabled.
de: Benutzer mit dieser E-Mail wurde deaktiviert.
ru: Пользователь с этой эл.почтой был отключен.

# authStatusTooManyRequests
source: Too many requests. Try again later.
de: Zu viele Anfragen. Versuchen Sie es später noch einmal.
ru: Слишком много запросов. Попробуйте позже.

# authStatusOperationNotAllowed
source: Signing in with Email and Password is not enabled.
de: Anmeldung mit E-Mail und Passwort ist nicht aktiviert.
ru: Вход с помощью электронной почты и пароля не включен.

# authStatusEmailAlreadyExists
source: This email has already been registered. Please login or reset your password.
de: Diese E-Mail wurde bereits registriert. Bitte loggen Sie sich ein oder setzen Sie Ihr Passwort zurück.
ru: Этот адрес электронной почты уже был зарегистрирован. Пожалуйста, войдите или сбросьте свой пароль.

# authStatusUndefError
source: An undefined Error happened.
de: Ein undefinierter Fehler ist aufgetreten.
ru: Непредвиденная ошибка случилась. Бывает.
